In [2]:
"""31:00 / 1:05:23"""
import pandas as pd

In [3]:
dic = {
    "name": ["Harry", "Rohan", "Skillf", "Shubh", "Aamit", "Ahmed", "Raheman"],
    "city": ["Rampur", "Kolkata", "Bareilly", "Antarctica", "Kolkata", "Delhi", "Mumbai"],
    "marks": [92, 34, 24, 17, 15, 14, 34]
}

In [5]:
df = pd.DataFrame(dic) #to create a dataFrame
df

      name        city  marks
0    Harry      Rampur     92
1    Rohan     Kolkata     34
2   Skillf    Bareilly     24
3    Shubh  Antarctica     17
4    Aamit     Kolkata     15
5    Ahmed       Delhi     14
6  Raheman      Mumbai     34

In [37]:
# df.to_csv("friends.csv") #to export into csv file

df.to_csv("friends.csv", index=False) #to export into csv file without index

In [6]:
df.head() #returns only first five results (default)

     name        city  marks
0   Harry      Rampur     92
1   Rohan     Kolkata     34
2  Skillf    Bareilly     24
3   Shubh  Antarctica     17
4   Aamit     Kolkata     15

In [7]:
df.tail() #returns only last five results (default)

      name        city  marks
2   Skillf    Bareilly     24
3    Shubh  Antarctica     17
4    Aamit     Kolkata     15
5    Ahmed       Delhi     14
6  Raheman      Mumbai     34

In [8]:
df.head(2) #returns only first two results

    name     city  marks
0  Harry   Rampur     92
1  Rohan  Kolkata     34

In [9]:
df.tail(2) #returns only last two results (default)

      name    city  marks
5    Ahmed   Delhi     14
6  Raheman  Mumbai     34

In [10]:
df.describe() #static analysis

           marks
count   7.000000
mean   32.857143
std    27.400904
min    14.000000
25%    16.000000
50%    24.000000
75%    34.000000
max    92.000000

In [11]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [12]:
df.columns

Index(['name', 'city', 'marks'], dtype='object')

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   city    7 non-null      object
 2   marks   7 non-null      int64
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes